archives/2024/Results/Verifications/S2427/bottleneck-determination/point_select/threads-10/sysbench.log
$ time sysbench --config-file=sysbench.conf --threads=10 oltp_point_select --tables=32 --table-size=1000000 --db-ps-mode=auto --rand-ty
pe=uniform run
sysbench 1.0.20 (using system LuaJIT 2.1.1700206165)

Running the test with following options:
Number of threads: 10
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 10 tps: 7635.12 qps: 7635.12 (r/w/o: 7635.12/0.00/0.00) lat (ms,95%): 2.26 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 10 tps: 7836.87 qps: 7836.87 (r/w/o: 7836.87/0.00/0.00) lat (ms,95%): 2.22 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 10 tps: 7972.41 qps: 7972.41 (r/w/o: 7972.41/0.00/0.00) lat (ms,95%): 2.18 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 10 tps: 7914.31 qps: 7914.31 (r/w/o: 7914.31/0.00/0.00) lat (ms,95%): 2.22 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 10 tps: 7880.74 qps: 7880.74 (r/w/o: 7880.74/0.00/0.00) lat (ms,95%): 2.22 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 10 tps: 7897.96 qps: 7897.96 (r/w/o: 7897.96/0.00/0.00) lat (ms,95%): 2.30 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 10 tps: 7881.20 qps: 7881.20 (r/w/o: 7881.20/0.00/0.00) lat (ms,95%): 2.22 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 10 tps: 7891.36 qps: 7891.36 (r/w/o: 7891.36/0.00/0.00) lat (ms,95%): 2.26 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 10 tps: 8001.49 qps: 8001.49 (r/w/o: 8001.49/0.00/0.00) lat (ms,95%): 2.14 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            787985
        write:                           0
        other:                           0
        total:                           787985
    transactions:                        787985 (7879.29 per sec.)
    queries:                             787985 (7879.29 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          100.0062s
    total number of events:              787985

Latency (ms):
         min:                                    0.66
         avg:                                    1.27
         max:                                   39.57
         95th percentile:                        2.22
         sum:                               998569.21

Threads fairness:
    events (avg/stddev):           78798.5000/170.87
    execution time (avg/stddev):   99.8569/0.00


real    1m40.076s
user    0m16.246s
sys     0m30.043s